[
  {
    "date": "March 24th, 2020",
    "longtext": "I was commissioned to make this chrome extension, but the person never paid. I decided to take up the project and made it better and uploaded it to the chrome store. It's a simple pretty inefficient chrome extension to display the COVID-19 cases in the United States by each state with filtering by all the statistics such as positive cases, negative cases, and more. It's my first chrome extension and I think it's decent for being my first chrome extension. I had to do quite a few work arounds because chrome extensions are tight about security.",
    "projecttitle": "covid-19-extension",
    "projecturl": "https://chrome.google.com/webstore/detail/covid-19-tracker/hneejppldokgoladcnbmfkedbilapddf",
    "imgsource": "https://i.imgur.com/62TLXYt.png",
    "articletitle": "COVID-19 Tracking Extension"
  },
  {
    "date": "August 27, 2019",
    "longtext": "This project started in a similar way to my Reddit video creation bot. I saw a ton of TikTok compilations on Youtube and wanted to get those views. I decided to start creating a script to do this, which I did, but in order to have cleaner code I created a python package and uploaded it to PyPi so anyone can use it. As I'm writing this it's currently got just under 14,000 downloads. It was my first python package and I am surprised how much attention and downloads it has gotten over just under a year when writing this of support. I learned a lot about reverse engineering an application and manipulating api calls.",
    "projecttitle": "tiktok-api",
    "projecturl": "https://github.com/davidteather/TikTok-Api",
    "imgsource": "https://i.imgur.com/xWEvEm9.png",
    "articletitle": "TikTok-Api"
  },
  {
    "date": "July 1st, 2019",
    "longtext": "For this project I had to develop a content management system for an archaeology company in the UK. This system allows the owners of the site to add new project pages, similar to a blog formatting. In this project I used NodeJS and MySQL. I learned how to make an efficient CMS system that is also very user-friendly. Unfortunately, you will not be able to access the CMS system as it is only for the site owners, however you will still be able to view the blog style posts that they have published. I also learned how to create a file uploading system, which I had never done before and it was an important functionality of the website.",
    "projecttitle": "past-participate",
    "projecturl": "http://pastparticipate.co.uk/",
    "imgsource": "https://i.imgur.com/Ypv2bVW.png",
    "articletitle": "Past Participate"
  },
  {
    "date": "April 12th, 2019",
    "longtext": "I had the idea for this project when friends in a groupchat wanted statistics on how many messages had been ever sent in the groupchat we are all in. I looked into it and realized that GroupMe does have an API. At the start this bot only had basic functionality and just statistics for the chat. However, it soon began to develop further with different APIs ranging from Joke APIs, Quote APIs, and finally my other functions I made. This bot ended up being over 1,000 lines in python overall. It's not a publicly accessible bot as it's just running on a groupchat with my friends. I learned how to make my first chatbot in python with these different functions. It was a fun way to develop something that could interact with my friends and not just for my own enjoyment.",
    "projecttitle": "groupme-bot",
    "projecturl": "NoUrl",
    "imgsource": "https://i.imgur.com/ICmLnmp.png",
    "articletitle": "GroupMe Bot"
  },
  {
    "date": "March 28th, 2019",
    "longtext": "Once again, this project was supposed to be a lot simpler and not as a publicly accessible website. However, when the person who was supposed to pay me never responded to any follow up questions. I decided it was something to do and finished it and created a website out of it. The website is not fully finished, I may end up revisiting the project in the future. The flow of this website is you sign up and create a 'listing' to get emailed when a peer to peer microloan that fits certain criteria that you specify in the 'listing'. It taught me a LOT about REGEX/Regular Expressions as that is what I use to extract information from a user formatted string. It was quite difficult to actually learn REGEX, however now the website works pretty well and I am fairly satisfied with the performance.",
    "projecttitle": "lending-profit",
    "projecturl": "https://lendingprofit.com/",
    "imgsource": "https://i.imgur.com/MvNKuoS.png",
    "articletitle": "Lending Profit"
  },
  {
    "date": "July 10th, 2019",
    "longtext": "This project wasn't too hard as I applied the skills I learned from the video captioner project here using FFmpeg again. FFmpeg is a tool to edit videos programmatically. I learned how to use Amazon's polly service, which is a text to speech engine on their AWS service.",
    "projecttitle": "reddit-video-creation",
    "projecturl": "NoUrl",
    "imgsource": "https://i.imgur.com/WvFbsxL.png",
    "articletitle": "Reddit Video Creation"
  },
  {
    "date": "April 10th, 2019",
    "longtext": "I was being paid to manually edit a company's videos to have captions at the bottom for social media posting. After about a week I realized I was not being paid enough for this tedious work I had to do everyday. I started to develop a program that would take a video and automatically add captions to them. This was very challenging because I had never edited videos without using something like Sony Vegas before. I found FFmpeg, this is a program that lets you edit videos in any programming language. The script would basically split up the video's audio every 2 seconds or so and send them to a speech recognition service to get what was said in each clip and put that text on the video. After a while I ended up finishing this script and taking out any bugs and for a few weeks I ended up using this program to provide the company with edited videos. I decided to start to make a website for the software as well, in the development of the website I learned how to use NodeJS, Microsoft Azure's speech to text engine, how to efficiently store data in MySQL, I learned how to create a referral system for users using the site. It was a huge step forwards in my ability to create websites. I ended up never actually making the website public. I would create this project differently today by using voice recognition to detect at specific time stamps not splitting it up into every 2 seconds and checking what text is in there.",
    "projecttitle": "video-captioner",
    "projecturl": "NoUrl",
    "imgsource": "https://i.imgur.com/uh09p0w.png",
    "articletitle": "Video Captioner"
  },
  {
    "date": "June 23rd, 2017",
    "longtext": "Going into this project I had no idea about any web development. Honestly, looking back it's amazing how much I've improved in 4 years (at the time of writing). I had no clue how to even write HTML or make a good looking website. I had no understanding of databases. I ended up using PHP for my website backend. I managed to learn what a database was and how to access it in PHP. I ended up making the website along with some other basic functionality I messed around with. I had some small applications on the website such as a random string generator from 2 words. Honestly, it was a ton of fun and a great learning experience. Unfortunately, I didn't know the importance of backing things up. I didn't lose everything, but most of it has disappeared, and it is no longer running.",
    "projecttitle": "dealsteal-us",
    "projecturl": "NoUrl",
    "imgsource": "https://i.imgur.com/o01KYfV.png",
    "articletitle": "DealSteal"
  }
]